1s/ERP/Conf/Catalogs/Лико_ПакетноеФормированиеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_ПакетноеФормированиеДокументов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснованиеИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснованиеСиноним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументСиноним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РеквизитыДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитСиноним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_ПакетноеФормированиеДокументов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция СписокДокументов()
	СписокДокументов= Новый СписокЗначений;
	Для каждого Документ Из Метаданные.Документы  Цикл
		СписокДокументов.Добавить(Документ.Имя); 		
	КонецЦикла;
	Возврат СписокДокументов;	
КонецФункции

&НаКлиенте
Процедура ДокументОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	СтандартнаяОбработка=Ложь;
	ОписаниеОповещение=Новый ОписаниеОповещения("ДокументОснованиеНачалоВыбораЗавершение",ЭтотОбъект);
	//ПоказатьВыборИзСписка(ОписаниеОповещение,СписокДокументов(),Элементы.ДокументОснование);
	
	ОткрытьФорму("Справочник.Лико_ПакетноеФормированиеДокументов.Форма.ФормаПодбораМетаданных",Новый Структура("РежимВыбора,ТипМетаданных", Истина,"Документы"),Элемент,,,,ОписаниеОповещение);
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеНачалоВыбораЗавершение(РезультатФормы,ПараметрыФормы) Экспорт
	Если    РезультатФормы<>Неопределено Тогда
		Объект.ДокументОснованиеИмя=РезультатФормы.Имя;
		Объект.Наименование=РезультатФормы.Синоним;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ОписаниеОповещение=Новый ОписаниеОповещения("ДокументОснованиеНачалоВыбораЗавершение",ЭтотОбъект);
	//ПоказатьВыборИзСписка(ОписаниеОповещение,СписокДокументов(),Элементы.ДокументОснование); 	
	ОткрытьФорму("Справочник.Лико_ПакетноеФормированиеДокументов.Форма.ФормаПодбораМетаданных",Новый Структура("РежимВыбора,ТипМетаданных", Истина,"Документы"),Элемент,,,,ОписаниеОповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовДокументСинонимНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ОписаниеОповещение=Новый ОписаниеОповещения("СписокДокументовДокументСинонимНачалоВыбораЗавершение",ЭтотОбъект);
	//ПоказатьВыборИзСписка(ОписаниеОповещение,СписокДокументов(),Элементы.ДокументОснование); 
	
	ОткрытьФорму("Справочник.Лико_ПакетноеФормированиеДокументов.Форма.ФормаПодбораМетаданных",Новый Структура("РежимВыбора,ТипМетаданных,ВыборПоФлажку,Документы", Истина,"Документы",ИСтина,СписокВыбранныхДокументов()),ЭтаФорма,,,,ОписаниеОповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовДокументСинонимНачалоВыбораЗавершение(РезультатФормы,ПараметрыФормы) Экспорт
	Если    РезультатФормы<>Неопределено Тогда
		Объект.СписокДокументов.Очистить();
		Для каждого ВыбДок Из РезультатФормы Цикл
			НоваяСтрока=Объект.СписокДокументов.Добавить();
			НоваяСтрока.ДокументИмя=ВыбДок.Имя;
			НоваяСтрока.ДокументСиноним=ВыбДок.Синоним;			
		КонецЦикла;
		//Объект.СписокДокументов.НайтиПоИдентификатору(Элементы.СписокДокументов.ТекущаяСтрока).ДокументИмя=РезультатФормы.Имя;
		//Объект.СписокДокументов.НайтиПоИдентификатору(Элементы.СписокДокументов.ТекущаяСтрока).ДокументСиноним=РезультатФормы.Синоним;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция СписокВыбранныхДокументов() //+Лико m.shenderov 08.09.2017
	Возврат Объект.СписокДокументов.Выгрузить().ВыгрузитьКолонку("ДокументИмя"); 
КонецФункции //СписокВыбранныхДокументов -Лико m.shenderov 08.09.2017


&НаКлиенте
Процедура РедактироватьСписок(Команда)
	СтандартнаяОбработка=Ложь;
	ОписаниеОповещение=Новый ОписаниеОповещения("СписокДокументовДокументСинонимНачалоВыбораЗавершение",ЭтотОбъект);
	//ПоказатьВыборИзСписка(ОписаниеОповещение,СписокДокументов(),Элементы.ДокументОснование); 
	
	ОткрытьФорму("Справочник.Лико_ПакетноеФормированиеДокументов.Форма.ФормаПодбораМетаданных",Новый Структура("РежимВыбора,ТипМетаданных,ВыборПоФлажку,Документы", Истина,"Документы",ИСтина,СписокВыбранныхДокументов()),ЭтаФорма,,,,ОписаниеОповещение);
	
КонецПроцедуры


&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ОписаниеОповещение=Новый ОписаниеОповещения("СписокДокументовВыборЗавершение",ЭтотОбъект);
	//ПоказатьВыборИзСписка(ОписаниеОповещение,СписокДокументов(),Элементы.ДокументОснование); 
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДокументОснование",Объект.Наименование);
	СтруктураПараметров.Вставить("Документ",Объект.СписокДокументов.НайтиПоИдентификатору(ВыбраннаяСтрока).ДокументИмя);
	СтруктураПараметров.Вставить("Реквизиты",СписокРеквизитов(Объект.СписокДокументов.НайтиПоИдентификатору(ВыбраннаяСтрока).ДокументИмя));	
	ОткрытьФорму("Справочник.Лико_ПакетноеФормированиеДокументов.Форма.ФормаРеквизитовДокумента",СтруктураПараметров,ЭтаФорма,,,,ОписаниеОповещение);
	
КонецПроцедуры
&НаКлиенте 
Процедура СписокДокументовВыборЗавершение(РезультатФормы,ПараметрыФормы) Экспорт //+Лико m.shenderov 08.09.2017
	ИмяТекущегоДокумента=Объект.СписокДокументов.НайтиПоИдентификатору(Элементы.СписокДокументов.ТекущаяСтрока).ДокументИмя;
	
	Если    РезультатФормы<>Неопределено Тогда
		Объект.РеквизитыДокументов.НайтиСтроки(Новый Структура("ДокументИмя",ИмяТекущегоДокумента)).Очистить();
		
		Для каждого ВыбРекДок Из РезультатФормы Цикл
			НоваяСтрока=Объект.РеквизитыДокументов.Добавить();
			НоваяСтрока.ДокументИмя=ИмяТекущегоДокумента;
			НоваяСтрока.РеквизитИмя=ВыбРекДок.Имя;
			НоваяСтрока.РеквизитСиноним=ВыбРекДок.Синоним;
			НоваяСтрока.Формула=ВыбРекДок.Формула;
			
		КонецЦикла;
	КонецЕсли 	
КонецПроцедуры //СписокДокументовВыборЗавершение -Лико m.shenderov 08.09.2017

&НаСервере
Функция СписокРеквизитов(ДокументИмя) //+Лико m.shenderov 08.09.2017
	Массив = Новый Массив();
	НайденыеСтроки=Объект.РеквизитыДокументов.НайтиСтроки(Новый Структура("ДокументИмя",ДокументИмя));  		 
	
	Для каждого НСтрока Из НайденыеСтроки Цикл
		Структура = Новый Структура;
		Структура.Вставить("Имя",НСтрока.РеквизитИмя);
		Структура.Вставить("Формула",НСтрока.Формула);	
		Массив.Добавить(Структура);		
	КонецЦикла;
	Возврат Массив;
	
КонецФункции //СписокРеквизитов -Лико m.shenderov 08.09.2017
